In [1]:
import pandas as pd

In [2]:
data = pd.read_csv(r'C:\Users\prathamesh\Downloads\Celebal Trainee\source_data.csv')

In [3]:
data

      Name  Age  Salary
0     John   30   50000
1    Emily   25   45000
2  Michael   35   60000
3     Emma   28   55000

In [4]:
data.describe()

             Age        Salary
count   4.000000      4.000000
mean   29.500000  52500.000000
std     4.203173   6454.972244
min    25.000000  45000.000000
25%    27.250000  48750.000000
50%    29.000000  52500.000000
75%    31.250000  56250.000000
max    35.000000  60000.000000

In [5]:
exchange_rate = 0.85
data['Salary_EUR'] = data['Salary'] * exchange_rate

In [6]:
data.to_csv('transformed_data.csv', index=False)

In [7]:
transformed_data = pd.read_csv('transformed_data.csv')

In [8]:
transformed_data

      Name  Age  Salary  Salary_EUR
0     John   30   50000     42500.0
1    Emily   25   45000     38250.0
2  Michael   35   60000     51000.0
3     Emma   28   55000     46750.0

In [9]:
transformed_data.to_csv(r'C:\Users\prathamesh\Downloads\Celebal Trainee\transformed_data.csv', index=False)